Autodesk.Revit.UI.RibbonPanel
Represents a panel added by an External Application or External Command into the Add-Ins tab.
Remarks: The Panel class provides read and write access to the RibbonItems contained in the panel. Use of this class is not supported in Revit VSTA.